Спортклуб/src/Documents/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Оплата</name>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаАбонемента</types>
      <types>DocumentRef.ПродажаТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Абонемент</name>
      <type>
        <types>CatalogRef.Товары</types>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Спортклуб/src/AccumulationRegisters/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПоСтатье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ДоходыИРасходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидСтатьи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Спортклуб/src/Enums/СпособОплаты/СпособОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособОплаты</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Карта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийПеревод</name>
  </enumValues>
</mdclass:Enum>

Спортклуб/src/Enums/ВидСтатьи/ВидСтатьи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСтатьи</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

Спортклуб/src/Catalogs/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоходыИРасходы</name>
  <predefined>
    <items>
      <name>РасходНаПокупкуТовара</name>
      <description>Расход на покупку товара</description>
    </items>
    <items>
      <name>ОплатаОтКлиента</name>
      <description>Оплата от клиента</description>
    </items>
    <items>
      <name>КомиссияБанкуЭквайеру</name>
      <description>Комиссия банку эквайеру</description>
    </items>
    <items>
      <name>ПродажаТовара</name>
      <description>Продажа товара</description>
    </items>
    <items>
      <name>ПродажаАбонемента</name>
      <description>Продажа абонемента</description>
    </items>
  </predefined>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидСтатьи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Спортклуб/src/Documents/Оплата/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	СуммаПоДокументу = Услуги.Итог("Сумма");
	
	Если СпособОплаты = Перечисления.СпособОплаты.Карта Тогда
		
		Комиссия = СуммаПоДокументу / 100 * Константы.КомиссияБанкаЭквайера.Получить();
		СуммаДохода = СуммаПоДокументу - Комиссия;
		
		// регистр ДоходыИРасходы
		Движения.ДоходыИРасходы.Записывать = Истина;
		Движение = Движения.ДоходыИРасходы.Добавить();
		Движение.Период = Дата;
		Движение.Статья = Справочники.ДоходыИРасходы.КомиссияБанкуЭквайеру;
		Движение.Вид = Перечисления.ВидСтатьи.Расход;
		Движение.СуммаПоСтатье = Комиссия;
	
		Записать();
		
	Иначе
		
		СуммаДохода = СуммаПоДокументу;
		
	КонецЕсли;
	
	// регистр ДоходыИРасходы
	Движения.ДоходыИРасходы.Записывать = Истина;
	Движение = Движения.ДоходыИРасходы.Добавить();
	Движение.Период = Дата;
	Движение.Статья = Справочники.ДоходыИРасходы.ОплатаОтКлиента;
	Движение.Вид = Перечисления.ВидСтатьи.Доход;
	Движение.СуммаПоСтатье = СуммаДохода;

	Записать();
	
КонецПроцедуры
